export const siteConfig = {
  name: "Костылевой Элеоноры",
  title: "Студентка РГПУ им.Герцена ИВТ 4 курс",
  description: "Портфолио студента ИВТ 4 курса",
  accentColor: "#1d4ed8",
  social: {
    email: "elkostylevaa@gmail.com",
    github: "https://github.com/elyakkos",
  },
  aboutMe:
    "Около 2 лет занимаюсь организацией рабочих процессов в студии оздоровительных духовных практик. Распределяю задачи в команде, где есть дизайнер, копирайтер и смм-менеджер. Я получаю высшее образование по направлению «технологии разработки программного обеспечения», обладаю пониманием основ разработки, свободно читаю код на таких языках, как Python, C++, JavaScript и языки разметки, также обладаю пониманием базовых основ проектного управления.",
  skills: ["Javascript", "React", "Node.js", "Python", "Docker", "SQL", "MS Excel" ],
  projects: [
    {
      name: "1 курс",
      description:
        "Программирование, ИТ в физике, Информационные технологии, ИТ в математике, ЛАТМ, Основы компьютерной алгебры",
      link: "https://disk.yandex.ru/d/Snw4aqAuVxeNPg"     },
    {
      name: "2 курс",
      description:
        "Интегралы и дифф.уравнения, Анализ данных, Базы данных, Вычислительная техника, Вычислительная математика, Операционные системы, Программирование, Технологии компьютерного моделирования, Курсовая работа",
      link: "https://disk.yandex.ru/d/LmjoROtAvI8VeA"    },
    {
      name: "3 курс",
      description:
        "",
      link: "https://disk.yandex.ru/d/NiDfYnJ-pnChSQ",
    },
    {
      name: "4 курс",
      description:
        "",
      link: "https://disk.yandex.ru/d/8BjzUfqDv4Dx4w",
    },
  ],

  education: [
    {
      school: "РГПУ им.Герцена",
      degree: "Бакалавриат по программе 'Технологии разработки программного обеспечения'",
      dateRange: "2022 - 2026",
    },
    {
      school: "МФТИ",
      degree: "Программа проф.переподготовки по программе 'Продуктовая аналитика'",
      dateRange: "2024 - 2025",

    },
  ],
};
